In [5]:
import numpy as np
import pandas as pd

In [11]:
data = {c:[str(c) + str(i) for i in range(3)]for c in 'ABC'}
data

{'A': ['A0', 'A1', 'A2'], 'B': ['B0', 'B1', 'B2'], 'C': ['C0', 'C1', 'C2']}

In [12]:
pd.DataFrame(data)

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [28]:
data1 = {c:[str(c) + str(i) for i in range(3)]for c in 'BCD'}
data2 = {c:[str(c) + str(i) for i in range(3)]for c in 'BCD'}
print(pd.DataFrame(data1))
print(pd.DataFrame(data2))
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

    B   C   D
0  B0  C0  D0
1  B1  C1  D1
2  B2  C2  D2
    B   C   D
0  B0  C0  D0
1  B1  C1  D1
2  B2  C2  D2

In [32]:
df3 = df1.append(df2)
df3

    B   C   D
0  B0  C0  D0
1  B1  C1  D1
2  B2  C2  D2
0  B0  C0  D0
1  B1  C1  D1
2  B2  C2  D2

In [34]:
df2

    B   C   D
0  B0  C0  D0
1  B1  C1  D1
2  B2  C2  D2

In [39]:
df6 = pd.DataFrame({'name':['peter','paul','mary'],
                   'food':['fish','beans','bread']})
df7 = pd.DataFrame({'name':['mary','joseph'],
                   'drink':['wine','beer']})
print(df6)
print(df7)

    name   food
0  peter   fish
1   paul  beans
2   mary  bread
     name drink
0    mary  wine
1  joseph  beer

In [40]:
print(pd.merge(df6,df7))

   name   food drink
0  mary  bread  wine

In [46]:
print(pd.merge(df6,df7,how='left'))#左   按照df6的输入列合并
print(pd.merge(df6,df7,how='right'))#右  按df7的输入列合并

    name   food drink
0  peter   fish   NaN
1   paul  beans   NaN
2   mary  bread  wine
     name   food drink
0    mary  bread  wine
1  joseph    NaN  beer

In [49]:
pop = pd.read_csv('state-population.csv')
area = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')
print(pop.head());print(area.head());print(abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [64]:
merged = pd.merge(pop,abbrevs,how = 'outer',left_on = 'state/region',right_on = 'abbreviation')
merged.head()

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL